ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @file    ht32l5xxxx_ertc.c
 * @version $Rev:: 1172         $
 * @date    $Date:: 2026-02-09#$#
 * @brief   This file provides all the ERTC firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32l5xxxx_ertc.h"

/** @addtogroup HT32L5xxxx_Peripheral_Driver HT32L5xxxx Peripheral Driver
  * @{
  */

/** @defgroup ERTC ERTC
  * @brief ERTC driver modules
  * @{
  */

/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup ERTC_Private_Define ERTC private definitions
  * @{
  */
#define ERTC_YEAR_MASK                             0x0000FF00
#define ERTC_YEAR_MASK_SHIFT                       8
#define ERTC_MONTH_MASK                            0x0000001F
#define ERTC_MONTH_MASK_SHIFT                      0
#define ERTC_DAY_MASK                              0x00003F00
#define ERTC_DAY_MASK_SHIFT                        8
#define ERTC_WEEKDAY_MASK                          0x000000E0
#define ERTC_WEEKDAY_MASK_SHIFT                    5

#define ERTC_HOUR_MASK                             0x0000003F
#define ERTC_HOUR_MASK_SHIFT                       0
#define ERTC_MINUTE_MASK                           0x00007F00
#define ERTC_MINUTE_MASK_SHIFT                     8
#define ERTC_SECOND_MASK                           0x0000007F
#define ERTC_SECOND_MASK_SHIFT                     0
#define ERTC_AMPM_MASK                             0x00000040
#define ERTC_AMPM_MASK_SHIFT                       0

#define ERTC_ALARM_ALMINAE_SHIFT                   15
#define ERTC_ALARM_ALSECE_SHIFT                    7
#define ERTC_ALARM_ALDAY_SHIFT                     15
#define ERTC_ALARM_ALHOURAE_SHIFT                  7

#define ERTC_ALARM_DATEWEEKDAY_MASK_SHIFT          8
#define ERTC_ALARM_HOUR_MASK_SHIFT                 0
#define ERTC_ALARM_MINUTE_MASK_SHIFT               8
#define ERTC_ALARM_SECOND_MASK_SHIFT               0
#define ERTC_ALARM_AMPM_MASK_SHIFT                 0

#define ERTC_ROEN_MASK                             0x00008000
#define ERTC_FMT_MASK                              0x00000040
#define ERTC_PSCRST_POS                            0x00008000
#define ERTC_ERTCSRC_MASK                          0x00000006
#define ERTC_HSEPRESEL_MASK                        0x0000000C
#define ERTC_LSESM_MASK                            0x00000030
#define ERTC_LSESM_SHIFT                           4
#define ERTC_WUTEN_MASK                            0x00000010
#define ERTC_WUCLSEL_MASK                          0x000000E0
#define ERTC_WUCLSEL_SHIFT                         5
#define ERTC_CALEN_MASK                            0x00008000
#define ERTC_TSESR_MASK                            0x0000C000

#define Set_INIT          SetBit_BB((u32)&HT_ERTC->CR0, 0)
#define Reset_INIT        ResetBit_BB((u32)&HT_ERTC->CR0, 0)
#define Set_LSEEN         SetBit_BB((u32)&HT_ERTC->CR0, 3)
#define Reset_LSEEN       ResetBit_BB((u32)&HT_ERTC->CR0, 3)

#define Set_WUTEN         SetBit_BB((u32)&HT_ERTC->CR1, 4)
#define Reset_WUTEN       ResetBit_BB((u32)&HT_ERTC->CR1, 4)

#define Set_ALREN         SetBit_BB((u32)&HT_ERTC->CR1, 0)
#define Reset_ALREN       ResetBit_BB((u32)&HT_ERTC->CR1, 0)

#define Set_CALEN         SetBit_BB((u32)&HT_ERTC->CALR, 15)
#define Reset_CALEN       ResetBit_BB((u32)&HT_ERTC->CALR, 15)

#define Set_TSEN          SetBit_BB((u32)&HT_ERTC->CR1, 1)
#define Reset_TSEN        ResetBit_BB((u32)&HT_ERTC->CR1, 1)

#define Set_ROCLR         SetBit_BB((u32)&HT_ERTC->CR0, 8)
#define Reset_ROCLR       ResetBit_BB((u32)&HT_ERTC->CR0, 8)

/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/
static u32 gERTCUnProtectKey       = 0;
static u32 gERTCSubSecondms        = 0;
static u32 gERTCSubSecondus        = 0;
static u8  gWakeupTimerLastSetting = 0;
static u8  gRTCAutoReload          = 0;
static u8  gCompareMode            = 0;

static const u16 gDayBefireMonth[13] = { 0, 0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334};

/* Private functions ---------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
 * @brief  Converts 2-digit decimal value to BCD value.
 * @param  Value: Decimal byte to be converted.
 * @retval Converted BCD byte
 ************************************************************************************************************/
static u8 _ERTC_ByteToBcd(u8 Value)
{
  u8 bcdhigh = 0;
  while (Value >= 10)
  {
    bcdhigh++;
    Value -= 10;
  }
  return ((u8)(bcdhigh << 4) | Value);
}

