ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Converts BCD value to 2-digit decimal value.
 * @param  Value: BCD value to be converted.
 * @retval Converted decimal value
 ************************************************************************************************************/
static u8 _ERTC_BcdToByte(u8 Value)
{
  u8 tmp = 0;
  tmp = ((u8)(Value & (u8)0xF0) >> 4) * 10;
  return (tmp + (Value & (u8)0x0F));
}

/*********************************************************************************************************//**
 * @brief  Converts Hour Input Format 24 to 12
 * @param  ERTC_TimeStruct: pointer to a ERTC_TimeTypeDef structure that contains
 *         the time configuration information for the ERTC.
 * @retval Converted decimal value
 ************************************************************************************************************/
static void _ERTC_HourInputFormat_24_to_12(ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  vu32 tmpreg;
  tmpreg = _ERTC_BcdToByte(ERTC_TimeStruct->Hours);
  if (ERTC_TimeStruct->FMT == ERTC_HOURFORMAT_12)
  {
    Assert_Param(IS_ERTC_HOUR12(tmpreg));
    Assert_Param(IS_ERTC_AMPM(ERTC_TimeStruct->AMPM));
  }
  else
  {
    Assert_Param(IS_ERTC_HOUR24(tmpreg));
    if (tmpreg <= 11)
    {
      ERTC_TimeStruct->AMPM = ERTC_AM;
      if (tmpreg == 0)
      {
        ERTC_TimeStruct->Hours = 0x12;
      }
    }
    else
    {
      ERTC_TimeStruct->AMPM = ERTC_PM;
      if (tmpreg != 12)
      {
        ERTC_TimeStruct->Hours = _ERTC_ByteToBcd(tmpreg - 12);
      }
    }
  }
}

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup ERTC_Exported_Functions ERTC exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief  De-initialize the ERTC peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void ERTC_DeInit(void)
{
  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  /* Switch clock source to LSI                                                                             */
  HT_ERTC->CR0 = (HT_ERTC->CR0 & ~ERTC_ERTCSRC_MASK) | ERTC_SRC_LSI;
  while ((HT_ERTC->CR0 & ERTC_ERTCSRC_MASK) != ERTC_SRC_LSI){}; // Wait until clock switches to LSI

  Set_INIT;
  while ((HT_ERTC->SR & ERTC_FLAG_INITF) == 0);
  /* Clear CR0 except INIT and LSI                                                                          */
  HT_ERTC->CR0 &= 0x3;

  /* Reset TR, DR, CR and other related registers                                                           */
  HT_ERTC->CAR0    = 0x00000000;
  HT_ERTC->CAR1    = 0x00000112;
  HT_ERTC->CAR2    = 0x000000C1;
  HT_ERTC->CR1     = 0x00000000;
  /* Clear WUTF, TSOVF, TSF, ALRF and CRSF flags                                                            */
  HT_ERTC->SR      = 0x00001302;
  HT_ERTC->APSC    = 0x0000007F;
  HT_ERTC->SPSC    = 0x000080FF;
  HT_ERTC->WUTR    = 0x00000000;
  HT_ERTC->CALR    = 0x00000000;
  HT_ERTC->ALMR0   = 0x00000000;
  HT_ERTC->ALMR1   = 0x00000000;
  HT_ERTC->ALMSSMR = 0x00000000;
  HT_ERTC->ALMSSR  = 0x00000000;

  HT_ERTC->CR0 = 0;
  while ((HT_ERTC->CR0 & ERTC_ERTCSRC_MASK) != RESET){};

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Initialize the ERTC registers according to the specified parameters
 *         in ERTC_InitStruct.
 * @param  ERTC_InitStruct: Pointer to an ERTC_InitTypeDef structure that contains
 *         the configuration information for the ERTC peripheral.
 * @note   The ERTC prescaler registers are write-protected and can be written in
 *         initialization mode only.
 * @retval None
 ************************************************************************************************************/
void ERTC_InitBCD(ERTC_InitTypeDef* ERTC_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_ASYNCH_PREDIV(ERTC_InitStruct->AsynchPrediv));
  Assert_Param(IS_ERTC_SYNCH_PREDIV(ERTC_InitStruct->SynchPrediv));
  Assert_Param(IS_ERTC_HOUR_FORMAT(ERTC_InitStruct->Time.FMT));

  Assert_Param(IS_ERTC_YEAR(_ERTC_BcdToByte(ERTC_InitStruct->Date.Year)));
  Assert_Param(IS_ERTC_MONTH(_ERTC_BcdToByte(ERTC_InitStruct->Date.Month)));
  Assert_Param(IS_ERTC_DATE(_ERTC_BcdToByte(ERTC_InitStruct->Date.Day)));

  Assert_Param(IS_ERTC_MINUTES(ERTC_InitStruct->Time.Minutes));
  Assert_Param(IS_ERTC_SECONDS(ERTC_InitStruct->Time.Seconds));

  _ERTC_HourInputFormat_24_to_12(&ERTC_InitStruct->Time);

  ERTC_Cmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  /* Configure the hour format                                                                              */
  HT_ERTC->CR0 = (HT_ERTC->CR0 & ~ERTC_FMT_MASK) | ERTC_InitStruct->Time.FMT;

  /* Configure the prescalers                                                                               */
  HT_ERTC->APSC = ERTC_InitStruct->AsynchPrediv;
  HT_ERTC->SPSC = ERTC_PSCRST_POS | ERTC_InitStruct->SynchPrediv;

  /* Set the ERTC Date & Time                                                                               */
  HT_ERTC->CAR0 = (ERTC_InitStruct->Time.Minutes << ERTC_MINUTE_MASK_SHIFT) |
                  (ERTC_InitStruct->Time.Seconds << ERTC_SECOND_MASK_SHIFT);

  HT_ERTC->CAR1 = (ERTC_InitStruct->Date.Day   << ERTC_DAY_MASK_SHIFT)  | \
                  (ERTC_InitStruct->Time.Hours << ERTC_HOUR_MASK_SHIFT) | \
                  (ERTC_InitStruct->Time.AMPM  << ERTC_AMPM_MASK_SHIFT);

  HT_ERTC->CAR2 = (ERTC_InitStruct->Date.Year    << ERTC_YEAR_MASK_SHIFT)  | \
                  (ERTC_InitStruct->Date.Month   << ERTC_MONTH_MASK_SHIFT) | \
                  (ERTC_InitStruct->Date.WeekDay << ERTC_WEEKDAY_MASK_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;

  ERTC_Cmd(ENABLE);
}

