ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Initialize the ERTC registers according to the specified parameters(binary format)
 *         in ERTC_InitStruct.
 * @param  ERTC_InitStruct: Pointer to an ERTC_InitTypeDef structure that contains
 *         the configuration information for the ERTC peripheral.
 * @retval None
 ************************************************************************************************************/
void ERTC_Init(ERTC_InitTypeDef* ERTC_InitStruct)
{
  ERTC_InitTypeDef tmpStruct = *ERTC_InitStruct;

  /* Convert to BCD before calling BCD init                                                                 */
  tmpStruct.Date.Year  = _ERTC_ByteToBcd(ERTC_InitStruct->Date.Year);
  tmpStruct.Date.Month = _ERTC_ByteToBcd(ERTC_InitStruct->Date.Month);
  tmpStruct.Date.Day   = _ERTC_ByteToBcd(ERTC_InitStruct->Date.Day);

  tmpStruct.Time.Hours   = _ERTC_ByteToBcd(ERTC_InitStruct->Time.Hours);
  tmpStruct.Time.Minutes = _ERTC_ByteToBcd(ERTC_InitStruct->Time.Minutes);
  tmpStruct.Time.Seconds = _ERTC_ByteToBcd(ERTC_InitStruct->Time.Seconds);

  ERTC_InitBCD(&tmpStruct);
}

/*********************************************************************************************************//**
 * @brief  Enable or Disable ERTC
 * @param  NewState: DISABLE to enter initialization mode, ENABLE to exit.
 * @retval None
 ************************************************************************************************************/
void ERTC_Cmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if ((HT_ERTC->SR & ERTC_FLAG_INITF) == NewState)
  {
    /* Disable the write protection for ERTC registers                                                      */
    HT_ERTC->WPR = gERTCUnProtectKey;

    if (NewState)
    {
      Reset_INIT;
    }
    else
    {
      Set_INIT;
    }
    /* Enable the write protection for ERTC registers                                                       */
    HT_ERTC->WPR = 0xFFFF;
    while ((HT_ERTC->SR & ERTC_FLAG_INITF) == NewState){};
  }
}

/*********************************************************************************************************//**
 * @brief  Fill each ERTC_InitStruct member with its default value.
 * @param  ERTC_InitStruct: Pointer to an ERTC_InitTypeDef structure which will be initialized.
 * @retval None
 ************************************************************************************************************/
void ERTC_StructInit(ERTC_InitTypeDef* ERTC_InitStruct)
{
  /* Initialize the asynchronous/synchronous prescaler                                                      */
  ERTC_InitStruct->AsynchPrediv = 0x7F;
  ERTC_InitStruct->SynchPrediv  = 0xFF;

  /* Default Date: Monday, January 01 xx01                                                                  */
  ERTC_InitStruct->Date.WeekDay = ERTC_WEEKDAY_MONDAY;
  ERTC_InitStruct->Date.Day     = 1;
  ERTC_InitStruct->Date.Month   = 1;
  ERTC_InitStruct->Date.Year    = 1;

  /* Default Time: 00h:00min:00sec                                                                          */
  ERTC_InitStruct->Time.AMPM    = ERTC_AM;
  ERTC_InitStruct->Time.Hours   = 1;
  ERTC_InitStruct->Time.Minutes = 0;
  ERTC_InitStruct->Time.Seconds = 0;
  ERTC_InitStruct->Time.FMT     = ERTC_HOURFORMAT_12;
}

/*********************************************************************************************************//**
 * @brief  Enables or disables the ERTC registers write protection.
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_WriteProtectionCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
  /* Enable the write protection for ERTC registers                                                         */
    HT_ERTC->WPR = 0xFFFF;
  }
  else
  {
    /* Disable the write protection for ERTC registers                                                      */
    HT_ERTC->WPR = gERTCUnProtectKey;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the ERTC prescaler.
 * @param AsynchPrediv: Value of ERTC Asynchronous Prescaler.
 * @param SynchPrediv: Value of ERTC Synchronous Prescaler.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetPrescaler(u8 AsynchPrediv, u16 SynchPrediv)
{
  ERTC_Cmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  /* Configure the prescalers                                                                               */
  HT_ERTC->APSC = AsynchPrediv;
  HT_ERTC->SPSC = ERTC_PSCRST_POS | SynchPrediv;

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;

  ERTC_Cmd(ENABLE);
}

/*********************************************************************************************************//**
 * @brief Return the ERTC Asynchronous prescaler setting.
 * @retval The prescaler value.
 ************************************************************************************************************/
u8 ERTC_GetAsynchronousPrescaler(void)
{
  return HT_ERTC->APSC & 0x7F;
}

/*********************************************************************************************************//**
 * @brief Return the ERTC Synchronous prescaler setting.
 * @retval The prescaler value.
 ************************************************************************************************************/
u16 ERTC_GetSynchronousPrescaler(void)
{
  return HT_ERTC->SPSC & 0x7FFF;
}

