ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Select the ERTC timer clock source.
 * @param  Source: Specifies the clock source of ERTC and VDD power domain.
 *   @arg  ERTC_SRC_NOCLOCK   : No clock.
 *   @arg  ERTC_SRC_LSI       : Low speed internal clock.
 *   @arg  ERTC_SRC_LSE       : Low speed external clock.
 *   @arg  ERTC_SRC_HSEPRE    : High speed external clock prescaler.
 * @retval None
 ************************************************************************************************************/
void ERTC_ClockSourceConfig(ERTC_SRC_Enum Source)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_CLOCK_SRC(Source));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  HT_ERTC->CR0 = (HT_ERTC->CR0 & ~ERTC_ERTCSRC_MASK) | Source;
  while ((HT_ERTC->CR0 & ERTC_ERTCSRC_MASK) != Source){};

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief Set CK_ERTC HSE prescaler value.
 * @param Div: HSE Prescaler Selection bits [3:2].
 *   This parameter can be one of the following values:
 *     @arg ERTC_HSEPRE_DIV32: HSE/32 clock is selected
 *     @arg ERTC_HSEPRE_DIV16: HSE/16 clock is selected
 *     @arg ERTC_HSEPRE_DIV8 : HSE/8  clock is selected
 *     @arg ERTC_HSEPRE_DIV4 : HSE/4  clock is selected
 * @retval None
 ************************************************************************************************************/
void ERTC_SetHSEPrescaler(ERTC_HSEDIV_Enum Div)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_HSE_DIV(Div));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  HT_ERTC->CR1 = (HT_ERTC->CR1 & ~ERTC_HSEPRESEL_MASK) | Div;
  while ((HT_ERTC->CR1 & ERTC_HSEPRESEL_MASK) != Div){};

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Select the LSE startup mode.
 * @param  Mode: specify the LSE startup mode.
 *   This parameter can be one of the following values:
 *     @arg ERTC_LSESM_SLOW: Slow startup and requires least operating power
 *     @arg ERTC_LSESM_MEDIUM_SLOW: Medium-slow startup and requires less operating power
 *     @arg ERTC_LSESM_MEDIUM_FAST: Medium-fast startup and requires more operating power
 *     @arg ERTC_LSESM_FAST: Fast startup and requires high operating current.
 * @retval None
 ************************************************************************************************************/
void ERTC_LSESMConfig(ERTC_LSESM_Enum Mode)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_LSESM(Mode));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  HT_ERTC->CR0 = (HT_ERTC->CR0 & ~ERTC_LSESM_MASK) | ((u32)Mode << ERTC_LSESM_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Enable or Disable the LSE clock.
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_LSECmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState == DISABLE)
  {
    Reset_LSEEN;
    while (HT_CKCU->GCSR & CKCU_FLAG_LSERDY);
  }
  else
  {
    Set_LSEEN;
    while ((HT_CKCU->GCSR & CKCU_FLAG_LSERDY) == 0);
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Set the ERTC current date.
 * @param  ERTC_DateStruct: pointer to a ERTC_DateTypeDef structure that contains
 *         the date configuration information for the ERTC.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetDateBCD(ERTC_DateTypeDef* ERTC_DateStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_YEAR(_ERTC_BcdToByte(ERTC_DateStruct->Year)));
  Assert_Param(IS_ERTC_MONTH(_ERTC_BcdToByte(ERTC_DateStruct->Month)));
  Assert_Param(IS_ERTC_DATE(_ERTC_BcdToByte(ERTC_DateStruct->Day)));
  Assert_Param(IS_ERTC_WEEKDAY(ERTC_DateStruct->WeekDay));

  ERTC_Cmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  HT_ERTC->CAR1 = (HT_ERTC->CAR1 & ERTC_HOUR_MASK & ERTC_AMPM_MASK)    | \
                  ((ERTC_DateStruct->Day) << ERTC_DAY_MASK_SHIFT);
  HT_ERTC->CAR2 = (ERTC_DateStruct->Year    << ERTC_YEAR_MASK_SHIFT)    | \
                  (ERTC_DateStruct->Month   << ERTC_MONTH_MASK_SHIFT)   | \
                  (ERTC_DateStruct->WeekDay << ERTC_WEEKDAY_MASK_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;

  ERTC_Cmd(ENABLE);
}

