ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Set the ERTC current date (binary format).
 * @param  ERTC_DateStruct: pointer to a ERTC_DateTypeDef structure that contains
 *         the date configuration information for the ERTC.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetDate(ERTC_DateTypeDef* ERTC_DateStruct)
{
  ERTC_DateTypeDef tmpStruct = *ERTC_DateStruct;

  tmpStruct.Year  = _ERTC_ByteToBcd(ERTC_DateStruct->Year);
  tmpStruct.Month = _ERTC_ByteToBcd(ERTC_DateStruct->Month);
  tmpStruct.Day   = _ERTC_ByteToBcd(ERTC_DateStruct->Day);

  ERTC_SetDateBCD(&tmpStruct);
}

/*********************************************************************************************************//**
 * @brief  Set the ERTC current time.
 * @param  ERTC_TimeStruct: pointer to a ERTC_TimeTypeDef structure that contains
 *         the time configuration information for the ERTC.
 * @retval None.
 ************************************************************************************************************/
void ERTC_SetTimeBCD(ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_HOUR_FORMAT(ERTC_TimeStruct->FMT));
  Assert_Param(IS_ERTC_MINUTES(_ERTC_BcdToByte(ERTC_TimeStruct->Minutes)));
  Assert_Param(IS_ERTC_SECONDS(_ERTC_BcdToByte(ERTC_TimeStruct->Seconds)));

  _ERTC_HourInputFormat_24_to_12(ERTC_TimeStruct);

  ERTC_Cmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  /* Set the ERTC Date & Time                                                                               */
  HT_ERTC->CAR0 = (ERTC_TimeStruct->Minutes << ERTC_MINUTE_MASK_SHIFT) | \
                  (ERTC_TimeStruct->Seconds << ERTC_SECOND_MASK_SHIFT);
  HT_ERTC->CAR1 = (HT_ERTC->CAR1 & ERTC_YEAR_MASK)                         | \
                  (ERTC_TimeStruct->Hours << ERTC_HOUR_MASK_SHIFT)    | \
                  (ERTC_TimeStruct->AMPM << ERTC_AMPM_MASK_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;

  ERTC_Cmd(ENABLE);
}

/*********************************************************************************************************//**
 * @brief  Set the ERTC current time.(binary format)
 * @param  ERTC_TimeStruct: pointer to a ERTC_TimeTypeDef structure that contains
 *         the time configuration information for the ERTC.
 * @retval None.
 ************************************************************************************************************/
void ERTC_SetTime(ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  ERTC_TimeTypeDef tmpStruct = *ERTC_TimeStruct;
  tmpStruct.Hours   = _ERTC_ByteToBcd(ERTC_TimeStruct->Hours);
  tmpStruct.Minutes = _ERTC_ByteToBcd(ERTC_TimeStruct->Minutes);
  tmpStruct.Seconds = _ERTC_ByteToBcd(ERTC_TimeStruct->Seconds);
  ERTC_SetTimeBCD(&tmpStruct);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC current date.
 * @param  ERTC_DateStruct: Pointer to an ERTC_DateTypeDef structure that will
 *         contain the returned current date configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetDateBCD(ERTC_DateTypeDef* ERTC_DateStruct)
{
  u32 SSR1, SSR2, CAR1, CAR2;
  do
  {
    SSR1 = HT_ERTC->SSR;
    CAR1 = HT_ERTC->CAR1;
    CAR2 = HT_ERTC->CAR2;
    SSR2 = HT_ERTC->SSR;
  } while (SSR1 != SSR2);

  /* Fill the structure fields with the read parameters                                                     */
  ERTC_DateStruct->Year    = (CAR2 & ERTC_YEAR_MASK)    >> ERTC_YEAR_MASK_SHIFT;
  ERTC_DateStruct->Month   = (CAR2 & ERTC_MONTH_MASK)   >> ERTC_MONTH_MASK_SHIFT;
  ERTC_DateStruct->Day     = (CAR1 & ERTC_DAY_MASK)     >> ERTC_DAY_MASK_SHIFT;
  ERTC_DateStruct->WeekDay = (CAR2 & ERTC_WEEKDAY_MASK) >> ERTC_WEEKDAY_MASK_SHIFT;
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC current date.(binary format)
 * @param  ERTC_DateStruct: Pointer to an ERTC_DateTypeDef structure that will
 *         contain the returned current date configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetDate(ERTC_DateTypeDef* ERTC_DateStruct)
{
  ERTC_GetDateBCD(ERTC_DateStruct);
  ERTC_DateStruct->Year  = _ERTC_BcdToByte(ERTC_DateStruct->Year);
  ERTC_DateStruct->Month = _ERTC_BcdToByte(ERTC_DateStruct->Month);
  ERTC_DateStruct->Day   = _ERTC_BcdToByte(ERTC_DateStruct->Day);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC current time.
 * @param  ERTC_TimeStruct: Pointer to an ERTC_TimeTypeDef structure that will
 *         contain the returned current time configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetTimeBCD(ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  u32 SSR1, SSR2, CAR0, CAR1;
  do
  {
    SSR1 = HT_ERTC->SSR;
    CAR0 = HT_ERTC->CAR0;
    CAR1 = HT_ERTC->CAR1;
    SSR2 = HT_ERTC->SSR;
  } while (SSR1 != SSR2);

  /* Fill the structure fields with the read parameters                                                     */
  ERTC_TimeStruct->Hours   = (CAR1 & ERTC_HOUR_MASK)   >> ERTC_HOUR_MASK_SHIFT;
  ERTC_TimeStruct->Minutes = (CAR0 & ERTC_MINUTE_MASK) >> ERTC_MINUTE_MASK_SHIFT;
  ERTC_TimeStruct->Seconds = (CAR0 & ERTC_SECOND_MASK) >> ERTC_SECOND_MASK_SHIFT;
  ERTC_TimeStruct->AMPM    = (CAR1 & ERTC_AMPM_MASK)   >> ERTC_AMPM_MASK_SHIFT;
  ERTC_TimeStruct->FMT     = HT_ERTC->CR0 & ERTC_HOURFORMAT_MASK;
}

