ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Get the ERTC current time.(binary format)
 * @param  ERTC_TimeStruct: Pointer to an ERTC_TimeTypeDef structure that will
 *         contain the returned current time configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetTime(ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  ERTC_GetTimeBCD(ERTC_TimeStruct);
  ERTC_TimeStruct->Hours   = _ERTC_BcdToByte(ERTC_TimeStruct->Hours);
  ERTC_TimeStruct->Minutes = _ERTC_BcdToByte(ERTC_TimeStruct->Minutes);
  ERTC_TimeStruct->Seconds = _ERTC_BcdToByte(ERTC_TimeStruct->Seconds);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC current date and time.
 * @param  ERTC_DateStruct: Pointer to an ERTC_DateTypeDef structure that will
 *         contain the returned current date configuration.
 * @param  ERTC_TimeStruct: Pointer to an ERTC_TimeTypeDef structure that will
 *         contain the returned current time configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetDateTimeBCD(ERTC_DateTypeDef* ERTC_DateStruct, ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  u32 SSR1, SSR2, CAR0, CAR1, CAR2;
  do
  {
    SSR1 = HT_ERTC->SSR;
    CAR0 = HT_ERTC->CAR0;
    CAR1 = HT_ERTC->CAR1;
    CAR2 = HT_ERTC->CAR2;
    SSR2 = HT_ERTC->SSR;
  } while (SSR1 != SSR2);

  /* Fill the date structure fields                                                                         */
  ERTC_DateStruct->Year    = (CAR2 & ERTC_YEAR_MASK)    >> ERTC_YEAR_MASK_SHIFT;
  ERTC_DateStruct->Month   = (CAR2 & ERTC_MONTH_MASK)   >> ERTC_MONTH_MASK_SHIFT;
  ERTC_DateStruct->Day     = (CAR1 & ERTC_DAY_MASK)     >> ERTC_DAY_MASK_SHIFT;
  ERTC_DateStruct->WeekDay = (CAR2 & ERTC_WEEKDAY_MASK) >> ERTC_WEEKDAY_MASK_SHIFT;

  /* Fill the time structure fields                                                                         */
  ERTC_TimeStruct->Hours   = (CAR1 & ERTC_HOUR_MASK)   >> ERTC_HOUR_MASK_SHIFT;
  ERTC_TimeStruct->Minutes = (CAR0 & ERTC_MINUTE_MASK) >> ERTC_MINUTE_MASK_SHIFT;
  ERTC_TimeStruct->Seconds = (CAR0 & ERTC_SECOND_MASK) >> ERTC_SECOND_MASK_SHIFT;
  ERTC_TimeStruct->AMPM    = (CAR1 & ERTC_AMPM_MASK)   >> ERTC_AMPM_MASK_SHIFT;

  ERTC_TimeStruct->FMT = HT_ERTC->CR0 & ERTC_HOURFORMAT_MASK;
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC current date and time.(binary format)
 * @param  ERTC_DateStruct: Pointer to an ERTC_DateTypeDef structure that will
 *         contain the returned current date configuration.
 * @param  ERTC_TimeStruct: Pointer to an ERTC_TimeTypeDef structure that will
 *         contain the returned current time configuration.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetDateTime(ERTC_DateTypeDef* ERTC_DateStruct, ERTC_TimeTypeDef* ERTC_TimeStruct)
{
  ERTC_GetDateTimeBCD(ERTC_DateStruct, ERTC_TimeStruct);

  ERTC_DateStruct->Year    = _ERTC_BcdToByte(ERTC_DateStruct->Year);
  ERTC_DateStruct->Month   = _ERTC_BcdToByte(ERTC_DateStruct->Month);
  ERTC_DateStruct->Day     = _ERTC_BcdToByte(ERTC_DateStruct->Day);
  ERTC_DateStruct->WeekDay = _ERTC_BcdToByte(ERTC_DateStruct->WeekDay);

  ERTC_TimeStruct->Hours   = _ERTC_BcdToByte(ERTC_TimeStruct->Hours);
  ERTC_TimeStruct->Minutes = _ERTC_BcdToByte(ERTC_TimeStruct->Minutes);
  ERTC_TimeStruct->Seconds = _ERTC_BcdToByte(ERTC_TimeStruct->Seconds);
}

/*********************************************************************************************************//**
 * @brief  Gets the ERTC current Calendar Subseconds value.
 * @note   This function freeze the Time and Date registers after reading the SSR register.
 * @retval ERTC current Calendar Subseconds value.
 ************************************************************************************************************/
u32 ERTC_GetSubSecond(void)
{
  u16 spsc = HT_ERTC->SPSC;
  return ((spsc & 0x7FFF) - HT_ERTC->SSR);
}

/*********************************************************************************************************//**
 * @brief  Gets the ERTC current Calendar Subseconds value in milliseconds.
 * @note   Calculates how many milliseconds per tick, then converts the elapsed ticks to milliseconds.
 * @retval ERTC current Calendar Subseconds value in milliseconds.
 ************************************************************************************************************/
u32 ERTC_GetSubSecondms(void)
{
  /* Compute and cache the conversion factor if not already calculated                                      */
  if (gERTCSubSecondms == 0)
  {
    gERTCSubSecondms = (1000 << 20) / ((HT_ERTC->SPSC & 0x7FFF) + 1);
  }

  /* Elapsed ticks * milliseconds per tick = elapsed milliseconds                                           */
  return ((ERTC_GetSubSecond() * gERTCSubSecondms) >> 20);
}

/*********************************************************************************************************//**
 * @brief  Gets the ERTC current Calendar Subseconds value in microseconds.
 * @note   Calculates how many microseconds per tick, then converts the elapsed ticks to microseconds.
 * @retval ERTC current Calendar Subseconds value in microseconds.
 ************************************************************************************************************/
u32 ERTC_GetSubSecondus(void)
{
  /* Compute and cache the conversion factor if not already calculated                                      */
  if (gERTCSubSecondus == 0)
  {
    gERTCSubSecondus = 1000000 << 10 / ((HT_ERTC->SPSC & 0x7FFF) + 1);
  }

  /* Elapsed ticks * microseconds per tick = elapsed microseconds                                           */
  return ((ERTC_GetSubSecond() * gERTCSubSecondus) >> 10);
}

