ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Configures the ERTC Wakeup clock source.
 * @note   The Wakeup Clock source can only be changed when the ERTC Wakeup
 *         is disabled (Use the ERTC_WakeupTimerCmd(DISABLE)).
 * @param  ERTC_WakeupClock: Wakeup Clock source.
 *   This parameter can be one of the following values:
 *     @arg ERTC_WUP_TM_ERTC_DIV16 : ERTC Wakeup Counter Clock = RTCCLK/16
 *     @arg ERTC_WUP_TM_ERTC_DIV8  : ERTC Wakeup Counter Clock = RTCCLK/8
 *     @arg ERTC_WUP_TM_ERTC_DIV4  : ERTC Wakeup Counter Clock = RTCCLK/4
 *     @arg ERTC_WUP_TM_ERTC_DIV2  : ERTC Wakeup Counter Clock = RTCCLK/2
 *     @arg ERTC_WUP_TM_SPRE       : ERTC Wakeup Counter Clock = CK_SPRE Compare: 1~65536
 *     @arg ERTC_WUP_TM_SPRE_EXT   : ERTC Wakeup Counter Clock = CK_SPRE Compare: 65537~131072
 * @retval None
 ************************************************************************************************************/
void ERTC_WakeupTimerClockConfig(u8 ERTC_WakeupClock)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_WAKEUP_CLOCK(ERTC_WakeupClock));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if ((HT_ERTC->CR1 & ERTC_WUTEN_MASK) != RESET)
  {
    Reset_WUTEN;
  }
  while (!(HT_ERTC->SR & ERTC_FLAG_WUTWF)){};

  /* Configure the clock source                                                                             */
  HT_ERTC->CR1 = (HT_ERTC->CR1 & ~ERTC_WUCLSEL_MASK) | (ERTC_WakeupClock << ERTC_WUCLSEL_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Configures the ERTC Wakeup Compare.
 * @note   The ERTC Wakeup counter can only be written when the ERTC Wakeup
 *         is disabled (Use the ERTC_WakeupTimerCmd(DISABLE)).
 * @param  Compare: specifies the Wakeup Timer.
 *         This parameter can be a value from 0x0001 to 0x10000.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetWakeupTimerCompare(u32 Compare)
{
  Compare -= 1;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_WAKEUP_COUNTER(Compare));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;
  if (gRTCAutoReload == 1)
  {
    HT_ERTC->WUTR = Compare & 0xFFFF;
  }
  else
  {
    if (gCompareMode == GET_COUNTER)
    {
      HT_ERTC->WUTR = Compare & 0xFFFF;
      ERTC_WakeupTimerCmd(DISABLE);
      ERTC_WakeupTimerCmd(ENABLE);
    }
    else if (gCompareMode == GET_COMPARE)
    {
      HT_ERTC->WUTR = Compare & 0xFFFF;
    }
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Configures the ERTC Wakeup Compare.
 * @retval Wakeup Compare
 ************************************************************************************************************/
u32 ERTC_GetWakeupTimerCompare(void)
{
  return HT_ERTC->WUTR + 1;
}

/*********************************************************************************************************//**
 * @brief  Enables or Disables the ERTC Wakeup timer.
 * @param  NewState: new state of the Wakeup timer.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_WakeupTimerCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState == ENABLE)
  {
    Set_WUTEN;
  }
  else
  {
    Reset_WUTEN;
    while ((HT_ERTC->SR & ERTC_FLAG_WUTWF) == RESET){};
  }
  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Enable or Disable the specified wakeup source.
 * @param  ERTC_WAKEUP Selection of Wakeup source.
 *   This parameter can be any combination of the following values:
 *     @arg  ERTC_WAKEUP_ALR : Waken up by alarm.
 *     @arg  ERTC_WAKEUP_WUT  : Waken up by wakeup timer.
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_WakeupConfig(u32 ERTC_WAKEUP, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_WAKEUP(ERTC_WAKEUP));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState != DISABLE)
  {
    HT_ERTC->CR1 |= ERTC_WAKEUP;
  }
  else
  {
    HT_ERTC->CR1 &= ~ERTC_WAKEUP;
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Enables or disables the specified ERTC interrupts.
 * @param  ERTC_INT_x: specifies the ERTC interrupt sources to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ERTC_INT_CRS : Calendar Registers Synchronisation Interrupt mask
 *     @arg ERTC_INT_WUT : Wakeup Timer interrupt mask
 *     @arg ERTC_INT_ALR : Alarm interrupt mask
 * @param  NewState: new state of the specified ERTC interrupts.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_IntConfig(u32 ERTC_INT_x, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_CONFIG_INT(ERTC_INT_x));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR  = gERTCUnProtectKey;

  if (NewState == ENABLE)
  {
    HT_ERTC->CR1 |= ERTC_INT_x;
  }
  else
  {
    HT_ERTC->CR1 &= ~(ERTC_INT_x);
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

