ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Set the specified ERTC Alarm.
 * @note   The Alarm register can only be written when the corresponding Alarm
 *         is disabled (Use the ERTC_AlarmCmd(DISABLE)).
 * @param  ERTC_AlarmStruct: pointer to a ERTC_AlarmTypeDef structure that
 *                           contains the alarm configuration parameters.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetAlarmBCD(ERTC_AlarmTypeDef* ERTC_AlarmStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_ALARM_DATE_WEEKDAY_SEL(ERTC_AlarmStruct->AlarmDateWeekDaySel));
  Assert_Param(IS_ERTC_HOUR12(_ERTC_BcdToByte(ERTC_AlarmStruct->AlarmTime.Hours)));
  Assert_Param(IS_ERTC_MINUTES(_ERTC_BcdToByte(ERTC_AlarmStruct->AlarmTime.Minutes)));
  Assert_Param(IS_ERTC_SECONDS(_ERTC_BcdToByte(ERTC_AlarmStruct->AlarmTime.Seconds)));
  if (ERTC_AlarmStruct->AlarmDateWeekDaySel == ERTC_ALARMSEL_DATE)
  {
    Assert_Param(IS_ERTC_ALARM_DATE_WEEKDAY_DATE(_ERTC_BcdToByte(ERTC_AlarmStruct->AlarmDateWeekDay)));
  }
  else
  {
    Assert_Param(IS_ERTC_ALARM_DATE_WEEKDAY_WEEKDAY(_ERTC_BcdToByte(ERTC_AlarmStruct->AlarmDateWeekDay)));
  }
  _ERTC_HourInputFormat_24_to_12(&ERTC_AlarmStruct->AlarmTime);
  /* Disable the Alarm register                                                                             */
  ERTC_AlarmCmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  while (!(HT_ERTC->SR  &  ERTC_FLAG_ALRWF)){};
  HT_ERTC->ALMR0 = (ERTC_AlarmStruct->AlarmMask.AlarmMask_Minute << ERTC_ALARM_ALMINAE_SHIFT) | \
                   (ERTC_AlarmStruct->AlarmMask.AlarmMask_Second << ERTC_ALARM_ALSECE_SHIFT)  | \
                   (ERTC_AlarmStruct->AlarmTime.Minutes << ERTC_ALARM_MINUTE_MASK_SHIFT)      | \
                   (ERTC_AlarmStruct->AlarmTime.Seconds << ERTC_ALARM_SECOND_MASK_SHIFT);
  HT_ERTC->ALMR1 = (ERTC_AlarmStruct->AlarmMask.AlarmMask_Day  << ERTC_ALARM_ALDAY_SHIFT)    | \
                   (ERTC_AlarmStruct->AlarmMask.AlarmMask_Hour << ERTC_ALARM_ALHOURAE_SHIFT) | \
                   ((ERTC_AlarmStruct->AlarmDateWeekDaySel                                        | \
                    (ERTC_AlarmStruct->AlarmDateWeekDay)   << ERTC_ALARM_DATEWEEKDAY_MASK_SHIFT)) | \
                   (ERTC_AlarmStruct->AlarmTime.AMPM  << ERTC_ALARM_AMPM_MASK_SHIFT)         | \
                   (ERTC_AlarmStruct->AlarmTime.Hours << ERTC_ALARM_HOUR_MASK_SHIFT);

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Set the specified ERTC Alarm.(binary format)
 * @note   The Alarm register can only be written when the corresponding Alarm
 *         is disabled (Use the ERTC_AlarmCmd(DISABLE)).
 * @param  ERTC_AlarmStruct: pointer to a ERTC_AlarmTypeDef structure that
 *                           contains the alarm configuration parameters.
 * @retval None
 ************************************************************************************************************/
void ERTC_SetAlarm(ERTC_AlarmTypeDef* ERTC_AlarmStruct)
{
  ERTC_AlarmTypeDef tmpStruct = *ERTC_AlarmStruct;
  tmpStruct.AlarmTime.FMT     = _ERTC_ByteToBcd(ERTC_AlarmStruct->AlarmTime.FMT);
  tmpStruct.AlarmTime.Hours   = _ERTC_ByteToBcd(ERTC_AlarmStruct->AlarmTime.Hours);
  tmpStruct.AlarmTime.Minutes = _ERTC_ByteToBcd(ERTC_AlarmStruct->AlarmTime.Minutes);
  tmpStruct.AlarmTime.Seconds = _ERTC_ByteToBcd(ERTC_AlarmStruct->AlarmTime.Seconds);
  if (ERTC_AlarmStruct->AlarmDateWeekDaySel == ERTC_ALARMSEL_DATE)
  {
    tmpStruct.AlarmDateWeekDay = _ERTC_ByteToBcd(ERTC_AlarmStruct->AlarmDateWeekDay);
  }
  ERTC_SetAlarmBCD(&tmpStruct);
}

/*********************************************************************************************************//**
 * @brief  Configure the ERTC  Alarm Subseconds value and mask.*
 * @note   This function is performed  only when  the  Alarm is disabled.
 * @param  ERTC_AlarmSubSecondValue: specifies the Subseconds  value.
 *         This parameter  can  be a value from  0  to 0x00007FFF.
 * @param  ERTC_AlarmSubSecondMask: specifies the Subseconds  Mask.
 *   This parameter  can  be any combination of  the  following  values:
 *     @arg ERTC_ALARM_SUBSECOND_MASK_ALL    : All Alarm SS fields are masked.
 *                                             There is no comparison  on sub seconds for Alarm.
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_1 : SS[14:1] are don't care in Alarm comparison.
 *                                             Only SS[0] is compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_2 : SS[14:2] are don't care in Alarm comparison.
 *                                             Only SS[1:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_3 : SS[14:3] are don't care in Alarm comparison.
 *                                             Only SS[2:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_4 : SS[14:4] are don't care in Alarm comparison.
 *                                             Only SS[3:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_5 : SS[14:5] are don't care in Alarm comparison.
 *                                             Only SS[4:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_6 : SS[14:6] are don't care in Alarm comparison.
 *                                             Only SS[5:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_7 : SS[14:7] are don't care in Alarm comparison.
 *                                             Only SS[6:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_8 : SS[14:8] are don't care in Alarm comparison.
 *                                             Only SS[7:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_9 : SS[14:9] are don't care in Alarm comparison.
 *                                             Only SS[8:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_10: SS[14:10] are don't care in Alarm comparison.
 *                                             Only SS[9:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_11: SS[14:11] are don't care in Alarm comparison.
 *                                             Only SS[10:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_12: SS[14:12] are don't care in Alarm comparison.
 *                                             Only SS[11:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14_13: SS[14:13] are don't care in Alarm comparison.
 *                                             Only SS[12:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_SS14   : SS[14] is don't care in Alarm comparison.
 *                                             Only SS[13:0] are compared
 *     @arg ERTC_ALARM_SUBSECOND_MASK_NONE   : SS[14:0] are compared and must  match  to activate alarm
 * @retval None
 ************************************************************************************************************/
void ERTC_AlarmSubSecondConfig(u16 ERTC_AlarmSubSecondValue, u8 ERTC_AlarmSubSecondMask)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_ALARM_SUB_SECOND_VALUE(ERTC_AlarmSubSecondValue));
  Assert_Param(IS_ERTC_ALARM_SUB_SECOND_MASK(ERTC_AlarmSubSecondMask));

