ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  while (!(HT_ERTC->SR  &  ERTC_FLAG_ALRWF)){};

  /* Configure the Alarm SubSecond registers                                                                */
  HT_ERTC->ALMSSMR = ERTC_AlarmSubSecondMask;
  HT_ERTC->ALMSSR  = ERTC_AlarmSubSecondValue;

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}


/*********************************************************************************************************//**
 * @brief Enables or disables the specified ERTC Alarm.
 * @param NewState: new state of the specified alarm.
 *        This parameter can be: ENABLE or DISABLE.
 ************************************************************************************************************/
void ERTC_AlarmCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState != DISABLE)
  {
    Set_ALREN;
  }
  else
  {
    Reset_ALREN;
    while ((HT_ERTC->SR & ERTC_FLAG_ALRWF) == RESET){};
  }
  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Checks whether the specified ERTC flag is set or not.
 * @param  ERTC_FLAG_x: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ERTC_FLAG_WUTWF: Wakeup Timer write flag
 *     @arg ERTC_FLAG_WUTF : Wakeup Timer flag
 *     @arg ERTC_FLAG_TSOVF: Time Stamp Overflow flag
 *     @arg ERTC_FLAG_TSF  : Time Stamp event flag
 *     @arg ERTC_FLAG_ALRF : Alarm flag
 *     @arg ERTC_FLAG_RTCOF: ERTC output flag
 *     @arg ERTC_FLAG_ALRWF: Alarm write flag
 *     @arg ERTC_FLAG_SHPF : Shift operation pending flag
 *     @arg ERTC_FLAG_CRSF : Calendar Register Synchronisation flag
 *     @arg ERTC_FLAG_INITF: Initialisation flag
 * @retval The new state of  ERTC_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus ERTC_GetFlagStatus(u32 ERTC_FLAG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_GET_FLAG(ERTC_FLAG_x));
  if (HT_ERTC->SR & ERTC_FLAG_x)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief  Clears the ERTC's pending flags.
 * @param  ERTC_FLAG_x: specifies the ERTC flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg ERTC_FLAG_WUTF  : Wakeup Timer flag
 *     @arg ERTC_FLAG_TSOVF : Time Stamp Overflow flag
 *     @arg ERTC_FLAG_TSF   : Time Stamp event flag
 *     @arg ERTC_FLAG_ALRF  : Alarm flag
 *     @arg ERTC_FLAG_RTCOF : ERTC output flag
 *     @arg ERTC_FLAG_CRSF  : Registers Synchronized  flag
 * @retval None
 ************************************************************************************************************/
void ERTC_ClearFlag(u32 ERTC_FLAG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_CLEAR_FLAG(ERTC_FLAG_x));

  if (ERTC_FLAG_x & ERTC_FLAG_RTCOF)
  {
    Set_ROCLR; //write 1 to ROCLR to clear RTCOF
  }

  /* Clear the Flags in the ERTC_ISR register                                                               */
  HT_ERTC->SR = ERTC_FLAG_x;
}

/*********************************************************************************************************//**
 * @brief  Configures the ERTC output source.
 * @param  WMode: Specifies the output mode of the output signal.
 *     @arg ERTC_ROWM_TOGGLE
 *     @arg ERTC_ROWM_PULSE
 *     @arg ERTC_ROWM_LEVEL
 * @param  EventSel: Specifies which signal will be routed to the ERTC output.
 *   This parameter can be one of the following values:
 *     @arg ERTC_ROES_ALARM  : signal of Alarm mapped to output
 *     @arg ERTC_ROES_WAKEUP : signal of Wakeup mapped to output
 *     @arg ERTC_ROES_SPRE   : SPRE clock mapped to output
 *     @arg ERTC_ROES_APRE   : APRE clock mapped to output
 * @param  Pol: Specifies the polarity of the output signal.
 *   This parameter can be one of the following:
 *     @arg ERTC_ROAP_HIGH : The output pin is high when the ALRF/WUTF is high
 *     @arg ERTC_ROAP_LOW  : The output pin is low  when the ALRF/WUTF is high
 * @retval None
 ************************************************************************************************************/
void ERTC_OutConfig(ERTC_ROWM_Enum WMode, ERTC_ROES_Enum EventSel, ERTC_ROAP_Enum Pol)
{
  u16 ROEN;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_OUTPUT(EventSel));
  Assert_Param(IS_ERTC_OUTPUT_POL(Pol));

  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  ERTC_ClearFlag(ERTC_FLAG_RTCOF);
  ROEN = HT_ERTC->CR0 & ERTC_ROEN_MASK;

  //* Clear ROEN, ROAP, ROES, ROWM bits                                                                     */
  HT_ERTC->CR0 &= ~(0xFC00);
  while (HT_ERTC->CR0 & ERTC_ROEN_MASK){};

  /* Configure the output selection and polarity                                                            */
  if ((EventSel & ERTC_ROES_SPRE) || (EventSel & ERTC_ROES_APRE))
  {
    HT_ERTC->CR0 |= (ROEN | EventSel);
  }
  else
  {
    HT_ERTC->CR0 |= (ROEN | WMode | EventSel | Pol);
  }

  if (ROEN)
  {
    while (!(HT_ERTC->CR0 & ERTC_ROEN_MASK)){};
  }
  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

