ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Enables or Disables the ERTC Output.
 * @param  NewState: new state of the Wakeup timer.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_OutCmd(ControlStatus NewState)
{
  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState == ENABLE)
  {
    HT_ERTC->CR0 |= ERTC_ROEN_MASK;
    while (!(HT_ERTC->CR0 & ERTC_ROEN_MASK)){};
  }
  else
  {
    HT_ERTC->CR0 &= ~ERTC_ROEN_MASK;
    while (HT_ERTC->CR0 & ERTC_ROEN_MASK){};
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Configures the Calibration Settings.
 * @param  ERTC_CalibPeriod : Select the Smooth Calibration Period.
 *   This parameter can be can be one of the following values:
 *     @arg ERTC_CALIB_PERIOD_32 : The calibration periode is 32s.
 *     @arg ERTC_CALIB_PERIOD_16 : The calibration periode is 16s.
 *     @arg ERTC_CALIB_PERIOD_8  : The calibartion periode is  8s.
 * @param  ERTC_CalibPlusMask
 *   This parameter can be one of the following values:
 *     @arg ERTC_CALIB_ADD_PULSES
 *     @arg ERTC_CALIB_MASK_PULSES
 * @param  ERTC_CalibValue: Select the value of CALV[7:0] bits.
 *         This parameter can be one any value from 0 to 0x000000FF.
 * @retval None
 ************************************************************************************************************/
void ERTC_CalibConfig(u16 ERTC_CalibPeriod, u16 ERTC_CalibPlusMask, u8 ERTC_CalibValue)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_CALIB_PERIOD(ERTC_CalibPeriod));
  Assert_Param(IS_ERTC_CALIB_PLUS(ERTC_CalibPlusMask));

  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;
  if (ERTC_CalibPeriod == ERTC_CALIB_PERIOD_16)
  {
    ERTC_CalibValue = ERTC_CalibValue << 1;
  }
  else if (ERTC_CalibPeriod == ERTC_CALIB_PERIOD_8)
  {
    ERTC_CalibValue = ERTC_CalibValue << 2;
  }
  /* Configure the Smooth calibration settings                                                              */
  HT_ERTC->CALR = (HT_ERTC->CALR & ERTC_CALEN_MASK) | ERTC_CalibPeriod | ERTC_CalibPlusMask | ERTC_CalibValue;

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Enables or disables the calibration process.
 * @param  NewState: new state of the calibration.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_CalibCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  ERTC_Cmd(DISABLE);

  /* Disable the write protection for ERTC registers                                                        */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState != DISABLE)
  {
    Set_CALEN;
  }
  else
  {
    Reset_CALEN;
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;

  ERTC_Cmd(ENABLE);
}

/*********************************************************************************************************//**
 * @brief  Enables or Disables the ERTC TimeStamp functionality.
 * @param  NewState: new state of the TimeStamp.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ERTC_TimeStampCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));
  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  if (NewState != DISABLE)
  {
    Set_TSEN;
  }
  else
  {
    Reset_TSEN;
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC TimeStamp value and masks.
 * @param  ERTC_StampTimeStruct: pointer to a ERTC_TimeTypeDef structure that will
 *         contains the TimeStamp time values.
 * @param  ERTC_StampDateStruct: pointer to a ERTC_DateTypeDef structure that will
 *         contains the TimeStamp date values.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetTimeStampBCD(ERTC_DateTypeDef* ERTC_StampDateStruct, ERTC_TimeTypeDef* ERTC_StampTimeStruct)
{
  u32 TSR0, TSR1, TSR2;

  TSR0 = HT_ERTC->TSR0;
  TSR1 = HT_ERTC->TSR1;
  TSR2 = HT_ERTC->TSR2;

  ERTC_StampTimeStruct->Hours   = (TSR1 & ERTC_HOUR_MASK)   >> ERTC_HOUR_MASK_SHIFT;
  ERTC_StampTimeStruct->Minutes = (TSR0 & ERTC_MINUTE_MASK) >> ERTC_MINUTE_MASK_SHIFT;
  ERTC_StampTimeStruct->Seconds = (TSR0 & ERTC_SECOND_MASK) >> ERTC_SECOND_MASK_SHIFT;
  ERTC_StampTimeStruct->AMPM    = (TSR1 & ERTC_AMPM_MASK)   >> ERTC_AMPM_MASK_SHIFT;
  ERTC_StampTimeStruct->FMT     = HT_ERTC->CR0 & ERTC_HOURFORMAT_MASK;

  ERTC_StampDateStruct->Year    = 0;
  ERTC_StampDateStruct->Month   = (TSR2 & ERTC_MONTH_MASK)   >> ERTC_MONTH_MASK_SHIFT;
  ERTC_StampDateStruct->Day     = (TSR1 & ERTC_DAY_MASK)     >> ERTC_DAY_MASK_SHIFT;
  ERTC_StampDateStruct->WeekDay = (TSR2 & ERTC_WEEKDAY_MASK) >> ERTC_WEEKDAY_MASK_SHIFT;
}

