ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Get the ERTC TimeStamp value and masks.(binary format)
 * @param  ERTC_StampTimeStruct: pointer to a ERTC_TimeTypeDef structure that will
 *         contains the TimeStamp time values.
 * @param  ERTC_StampDateStruct: pointer to a ERTC_DateTypeDef structure that will
 *         contains the TimeStamp date values.
 * @retval None
 ************************************************************************************************************/
void ERTC_GetTimeStamp(ERTC_DateTypeDef* ERTC_StampDateStruct, ERTC_TimeTypeDef* ERTC_StampTimeStruct)
{
  ERTC_GetTimeStampBCD(ERTC_StampDateStruct, ERTC_StampTimeStruct);;

  ERTC_StampTimeStruct->Hours   = _ERTC_BcdToByte(ERTC_StampTimeStruct->Hours);
  ERTC_StampTimeStruct->Minutes = _ERTC_BcdToByte(ERTC_StampTimeStruct->Minutes);
  ERTC_StampTimeStruct->Seconds = _ERTC_BcdToByte(ERTC_StampTimeStruct->Seconds);

  ERTC_StampDateStruct->Month   = _ERTC_BcdToByte(ERTC_StampDateStruct->Month);
  ERTC_StampDateStruct->Day     = _ERTC_BcdToByte(ERTC_StampDateStruct->Day);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC timestamp Subseconds value.
 * @retval ERTC current timestamp Subseconds value.
 ************************************************************************************************************/
u32 ERTC_GetTimeStampSubSecond(void)
{
  u16 spsc = HT_ERTC->SPSC;
  return ((spsc & 0x7FFF) - HT_ERTC->TSSSR);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC timestamp Subseconds value in milliseconds.
 * @note   Calculates how many milliseconds per tick, then converts the elapsed ticks to milliseconds.
 * @retval ERTC current Calendar Subseconds value in milliseconds.
 ************************************************************************************************************/
u32 ERTC_GetTimeStampSubSecondms(void)
{
  /* Compute and cache the conversion factor if not already calculated                                      */
  if (gERTCSubSecondms == 0)
  {
    gERTCSubSecondms = (1000 << 20) / ((HT_ERTC->SPSC & 0x7FFF) + 1);
  }

  /* Elapsed ticks * milliseconds per tick = elapsed milliseconds                                           */
  return ((ERTC_GetTimeStampSubSecond() * gERTCSubSecondms) >> 20);
}

/*********************************************************************************************************//**
 * @brief  Get the ERTC timestamp Subseconds value in microseconds.
 * @note   Calculates how many microseconds per tick, then converts the elapsed ticks to microseconds.
 * @retval ERTC current Calendar Subseconds value in microseconds.
 ************************************************************************************************************/
u32 ERTC_GetTimeStampSubSecondus(void)
{
  /* Compute and cache the conversion factor if not already calculated                                      */
  if (gERTCSubSecondus == 0)
  {
    gERTCSubSecondus = 1000000 << 10 / ((HT_ERTC->SPSC & 0x7FFF) + 1);
  }

  /* Elapsed ticks * microseconds per tick = elapsed microseconds                                           */
  return ((ERTC_GetTimeStampSubSecond() * gERTCSubSecondus) >> 10);
}

/*********************************************************************************************************//**
 * @brief  Checks whether the specified ERTC Timestamp event source is set or not.
 * @param  ERTC_TS_EVT: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ERTC_TS_WAKEUP0_EVT
 *     @arg ERTC_TS_WAKEUP1_EVT
 * @retval The new state of ERTC_TS_EVT (SET or RESET).
 ************************************************************************************************************/
FlagStatus ERTC_GetTimestampEventSourceStatus(u32 ERTC_TS_EVT)
{
  Assert_Param(IS_ERTC_TS_EVT(ERTC_TS_EVT));
  if ((HT_ERTC->SR & 0xC000) == ERTC_TS_EVT)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief  Configures the Synchronization Shift Control Settings.
 * @note   When REFCKON is set, firmware must not write to Shift control register
 * @param  ERTC_ShiftSign : Select to add or substract Second Fractions to the time Calendar.
 *   This parameter can be one of the following values :
 *     @arg ERTC_SHIFT_SIGN_ADD : Add Second Fractions to the clock calendar.
 *     @arg ERTC_SHIFT_SIGN_SUB : Subtract Second Fractions to the clock calendar.
 * @param  ERTC_ShiftSubFS: Select the number of Second Fractions to Substitute.
 *         This parameter can be one any value from 0 to 0x7FFF.
 * @retval None
 ************************************************************************************************************/
void ERTC_SynchroShiftConfig(u8 ERTC_ShiftSign, u16 ERTC_ShiftSubFS)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ERTC_SHIFT_SIGN(ERTC_ShiftSign));

  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = gERTCUnProtectKey;

  /* Wait until the shift is completed                                                                      */
  while (((HT_ERTC->SR & ERTC_FLAG_SHPF) != RESET));

  /* Configure the Shift settings                                                                           */
  if (ERTC_ShiftSign == ERTC_SHIFT_SIGN_ADD)
  {
    HT_ERTC->SHIFTCR = ERTC_ShiftSubFS;
  }
  else
  {
    HT_ERTC->SHIFTCR = ~ERTC_ShiftSubFS + 1; //2's compliment
  }

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
}

/*********************************************************************************************************//**
 * @brief  Set the unprotect key.
 * @param  uUnProtectKey: protect key, shall be ERTC_UNPROTECT_KEY
 * @retval None
 ************************************************************************************************************/
void ERTC_SetUnProtectKey(u16 uUnProtectKey)
{
  gERTCUnProtectKey = uUnProtectKey;
}

