ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ertc.c
/*********************************************************************************************************//**
 * @brief  Get the total seconds elapsed since year 0, Jan 1, 12:00AM.
 * @retval Elapsed seconds (u32)
 ************************************************************************************************************/
u32 ERTC_EpochTime(void)
{
  u16 DayCount;
  u32 HourCount, MinuteCount, SecondCount;
  ERTC_DateTypeDef ERTC_Date;
  ERTC_TimeTypeDef ERTC_Time;
  ERTC_GetDateTime(&ERTC_Date, &ERTC_Time);

  /* Convert years into days (365 days per year plus leap year days)                                        */
  DayCount = ERTC_Date.Year * 365;
  if (ERTC_Date.Year != 0)
    DayCount += ((ERTC_Date.Year - 1) >> 2);

  /* Add days from previous months (fall-through switch accumulates backward)                               */
  DayCount += gDayBefireMonth[ERTC_Date.Month];
  /* leap year check                                                                                        */
  if (ERTC_Date.Month > 2 && (ERTC_Date.Year & 0x3) == 0  && ERTC_Date.Year > 0)
  {
    DayCount += 1;
  }

  /* Add current day                                                                                        */
  DayCount += ERTC_Date.Day - 1;

  /* Convert days to hours: total_days * 24 + AM/PM offset + hour value                                     */
  if ((HT_ERTC->CR0 & ERTC_HOURFORMAT_MASK) == ERTC_HOURFORMAT_12)
    HourCount = DayCount * 24 + (ERTC_Time.AMPM >> 6) * 12 + ((ERTC_Time.Hours == 12) ? 0 : ERTC_Time.Hours);
  else
    HourCount = DayCount * 24 + ERTC_Time.Hours;

  /* Convert hours to minutes                                                                               */
  MinuteCount = HourCount * 60 + ERTC_Time.Minutes;

  /* Convert minutes to seconds                                                                             */
  SecondCount = MinuteCount * 60 + ERTC_Time.Seconds;

  /* Subtract one day to align base point at 0-01-01 12:00:00 AM                                            */
  return SecondCount;
}

/*********************************************************************************************************//**
 * @brief  Check and verify the ERTC Wakeup Timer setting.
 * @note   The API is provided for RTC compatibility handling.
 * @param  WakeupTimerSetting: Specifies the wakeup timer configuration to be checked.
 *   @arg RTC_WAKEUP_CM
 *   @arg RTC_INT_CM
 *   @arg RTC_ROES_MATCH
 *   @arg RTC_WAKEUP_CSEC
 *   @arg RTC_INT_CSEC
 *   @arg RTC_ROES_SECOND
 * @retval None.
 ************************************************************************************************************/
void RTC_CheckWakeupTimerSetting(u8 WakeupTimerSetting)
{
  if (gWakeupTimerLastSetting != 0)
  {
    if (gWakeupTimerLastSetting != (WakeupTimerSetting))
    {
      /*
        ERROR: A compare mode has already been configured.
        Switching to a different mode is not allowed,
        to prevent mixing Compare and Second configurations.
        The system will halt here in while (1).
      */
      while (1){};
    }
  }
  else
  {
    if ((WakeupTimerSetting) == 3)
    {
      /*
        ERROR: Using RTC_*_CM | RTC_*_CSEC is not supported.
        Compare Match and Compare Second cannot be combined.
        The system will halt here in while (1).
      */
      while (1){};
    }
    gWakeupTimerLastSetting = (WakeupTimerSetting);
  }
}

/*********************************************************************************************************//**
 * @brief  Set RTC GET_COUNTER Mode Software Flag
 * @note   The API is provided for RTC compatibility handling.
 * @retval 0
 ************************************************************************************************************/
u32 RTC_GetCounter(void)
{
  if (gRTCAutoReload == 0)
  {
    gCompareMode = GET_COUNTER;
  }
  else
  {
    gCompareMode = GET_COMPARE;
  }
  return 0;
}

/*********************************************************************************************************//**
 * @brief  Set RTC GET_COMPARE Mode Software Flag
 * @note   The API is provided for RTC compatibility handling.
 * @retval 0
 ************************************************************************************************************/
u32 RTC_GetCompare(void)
{
  gCompareMode = GET_COMPARE;
  return 0;
}

/*********************************************************************************************************//**
 * @brief  Set Auto Reload Software Flag.
 * @note   The API is provided for RTC compatibility handling.
 * @param  NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void RTC_CMPCLRCmd(ControlStatus NewState)
{
  gRTCAutoReload = NewState;
}

/*********************************************************************************************************//**
 * @brief  Return the ERTC Status register.
 * @note   The API is provided for RTC compatibility handling.
 * @retval Status register value.
 ************************************************************************************************************/
u32 RTC_GetFlagStatus(void)
{
  u32 tempReg = HT_ERTC->SR;
  /* Disable the write protection for  ERTC registers                                                       */
  HT_ERTC->WPR = ERTC_UNPROTECT_KEY;

  HT_ERTC->SR = tempReg;

  /* Enable the write protection for ERTC registers                                                         */
  HT_ERTC->WPR = 0xFFFF;
  return tempReg & RTC_FLAG_MASK;
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
